week09/1-Micro-Blog/app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos"
SELECT "posts".* FROM "posts"
---
  def index
    @photos = Photo.all
    @posts = Post.all

INSERT INTO "photos" ("url", "created_at", "updated_at") VALUES (?, ?, ?)  [["url", "http://polkacafe.s3.amazonaws.com/articles/thumbs/ti_725_5336.3467960541.jpg"], ["created_at", "2016-02-11 18:31:39.242362"], ["updated_at", "2016-02-11 18:31:39.242362"]]
---
  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save

UPDATE "photos" SET "url" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["url", "http://images.clipartpanda.com/panda-drawing-9TRRzeL8c.jpeg"], ["updated_at", "2016-02-11 18:56:51.675652"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @photo.update(photo_params)