week09/1-Micro-Blog/app/controllers/posts_and_photos_controller.rb

SELECT "photos".* FROM "photos"
SELECT "posts".* FROM "posts"
---
  def index
    @photos = Photo.all
    @posts = Post.all