week12/1-authentication/app/controllers/sessions_controller.rb

  def create
    user = User.find_by_email(signin_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "gogogardev@gmail.com"]]