week10/1-online-store/app/controllers/brands_controller.rb

SELECT COUNT(*) FROM "brands"
---
  def count
    render json: Brand.count

SELECT "brands".* FROM "brands"
---
  def index
    render json: Brand.all

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    render json: Brand.find(params[:id])

SELECT "brands".* FROM "brands" WHERE (id > '3')
---
  def range
    render json: Brand.where("id > ?", params[:id])

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 1]]
---
  def destroy
    # @brand
    brand = Brand.find(params[:id])
    brand.destroy

SELECT  "brands".* FROM "brands" WHERE (id >= '3') LIMIT 2
---
  def from
    render json: Brand.where("id >= ?", params[:id]).limit(params[:count])

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "brands" SET "name" = ?, "description" = ? WHERE "brands"."id" = ?  [["name", "Update"], ["description", "Hello, I'm updating!"], ["id", 6]]
---
  def update
    brand = Brand.find(params[:id])
    if brand.update(brand_params)

INSERT INTO "brands" ("name", "description") VALUES (?, ?)  [["name", "Amazing"], ["description", "Wonderful"]]
---
  def create
    #<<-JSON
    #{
    #  "name": "So fancy",
    #  "quality": "Great"
    #}
    #JSON

    #params[:name]
    #params[:quality]

    #Винаги има controller, action, format
    #params[:controller] #brands
    #params[:action] #create
    #params[:format] #

    #params[:brand] = {name: "So fancy", quality: "Great"}
    #params[:brand][:name] == params[:name]
    #params[:brand][:quality] == params[:quality]
    #params[:brand][:controller] == nil #!!!

    brand = Brand.new(brand_params)
    if brand.save