week10/1-online-store/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    render json: Category.all

INSERT INTO "categories" ("name") VALUES (?)  [["name", "coffee"]]
---
  def create
    category = Category.new(category_params)
    if category.save