week10/1-online-store/app/controllers/products_controller.rb

SELECT COUNT(*) FROM "products"
---
  def count
    render json: Product.count

SELECT "products".* FROM "products"
---
  def index
    render json: Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    render json: Product.find(params[:id])

SELECT "products".* FROM "products" WHERE (id > '1')
---
  def range
    render json: Product.where("id > ?", params[:id])

SELECT  "products".* FROM "products" WHERE (id >= '2') LIMIT 2
---
  def from
    render json: Product.where("id >= ?", params[:id]).limit(params[:count])

INSERT INTO "products" ("name", "brand_id", "category_id", "price", "quantity") VALUES (?, ?, ?, ?, ?)  [["name", "Oreo"], ["brand_id", 4], ["category_id", 2], ["price", 1.9], ["quantity", 5]]
---
  def create
    product = Product.new(product_params)
    if product.save