week11/1-course-management/app/controllers/lectures_controller.rb

SELECT "lectures".* FROM "lectures"
---
  def index
    @lectures = Lecture.all

INSERT INTO "lectures" ("name", "body") VALUES (?, ?)  [["name", "New lecture"], ["body", "bodyddddd"]]
---
  def create
    @lecture = Lecture.new(lecture_params)
    if @lecture.save

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @lecture = Lecture.find(params[:id])

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @lecture = Lecture.find(params[:id])

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "lectures" SET "body" = ? WHERE "lectures"."id" = ?  [["body", "update"], ["id", 1]]
---
  def update
    @lecture = Lecture.find(params[:id])
    if @lecture.update(lecture_params)

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "lectures" WHERE "lectures"."id" = ?  [["id", 2]]
---
  def destroy
    @lecture = Lecture.find(params[:id])
    if @lecture.destroy