week11/1-course-management/app/controllers/solutions_controller.rb

  def create
    @solution = @task.solutions.build(solution_params)
    if @solution.save
---
INSERT INTO "solutions" ("body", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "wjkfhwuihgewu"], ["task_id", 1], ["created_at", "2016-04-12 17:40:38.012482"], ["updated_at", "2016-04-12 17:40:38.012482"]]

  def set_task
    @lecture = Lecture.find(params[:lecture_id])
    @task = @lecture.tasks.find(params[:task_id])
---
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."lecture_id" = ? AND "tasks"."id" = ? LIMIT 1  [["lecture_id", 1], ["id", 1]]