week11/1-course-management/app/views/lectures/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."lecture_id" = ?  [["lecture_id", 1]]
---

<%= @lecture.tasks.each do |task| task.inspect end %>